app/controllers/comments_controller.rb

    def create
        @comment = @post.comments.create(comment_params)
        @comment.user = current_user

        if @comment.save
---
INSERT INTO "comments" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 6], ["user_id", 2], ["created_at", "2022-07-04 07:45:53.612727"], ["updated_at", "2022-07-04 07:45:53.612727"]]
UPDATE "comments" SET "updated_at" = ? WHERE "comments"."id" = ?  [["updated_at", "2022-07-03 23:19:34.232911"], ["id", 1]]