app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order("created_at DESC").paginate(page: params[:page], per_page: 3)
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT COUNT(*) FROM "posts"

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hiiss"], ["body", "herro"], ["created_at", "2022-07-04 05:39:36.435157"], ["updated_at", "2022-07-04 05:39:36.435157"], ["user_id", 1]]